Тест_ЗУП_31_КОРП/src/Enums/ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов/ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов</name>
  <enumValues>
    <name>Стандартные</name>
  </enumValues>
  <enumValues>
    <name>Исходные</name>
  </enumValues>
  <enumValues>
    <name>УвеличиватьСтандартные</name>
  </enumValues>
  <enumValues>
    <name>УвеличиватьИсходные</name>
  </enumValues>
  <enumValues>
    <name>РасширятьСтандартные</name>
  </enumValues>
  <enumValues>
    <name>РасширятьИсходные</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов/ManagerModule.bsl
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УпрощенныйРежим") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;

		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.Стандартные;
		Элемент.Представление = НСтр("ru = 'Стандартные'");
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.Исходные;
		Элемент.Представление = НСтр("ru = 'Исходные'");
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.УвеличиватьСтандартные;
		Элемент.Представление = НСтр("ru = 'Увеличивать стандартные'");
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.РасширятьСтандартные;
		Элемент.Представление = НСтр("ru = 'Расширять стандартные'");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
